import 'package:flutter/cupertino.dart';
import 'package:get/get.dart';
import 'package:project_one/models/faq_menu.dart';

class FAQController extends GetxController {
  List<FAQMenuModel> faqMenu(BuildContext context) {
    List<FAQMenuModel> faqMenuModelList = [
      new FAQMenuModel('ما هو التطبيق وماذا يقدم؟',
          'ببساطة، قم بتنزيل التطبيق من متجر التطبيقات المناسب لنظام تشغيل هاتفك الذكي. قم بإنشاء حساب شخصي وابدأ في استكشاف قائمة الطعام واختيار وجباتك المفضلة.'),
      new FAQMenuModel('كيف يمكنني البدء في استخدام التطبيق؟',
          'ببساطة، قم بتنزيل التطبيق من متجر التطبيقات المناسب لنظام تشغيل هاتفك الذكي. قم بإنشاء حساب شخصي وابدأ في استكشاف قائمة الطعام واختيار وجباتك المفضلة.'),
      new FAQMenuModel('كيف يتم توصيل الطعام؟',
          'ببساطة، قم بتنزيل التطبيق من متجر التطبيقات المناسب لنظام تشغيل هاتفك الذكي. قم بإنشاء حساب شخصي وابدأ في استكشاف قائمة الطعام واختيار وجباتك المفضلة.'),
      new FAQMenuModel('هل يتوفر تشكيلة من الأطعمة للاختيار من بينها؟',
          'ببساطة، قم بتنزيل التطبيق من متجر التطبيقات المناسب لنظام تشغيل هاتفك الذكي. قم بإنشاء حساب شخصي وابدأ في استكشاف قائمة الطعام واختيار وجباتك المفضلة.'),
      new FAQMenuModel('كيف يتم دفع ثمن الطعام؟',
          'ببساطة، قم بتنزيل التطبيق من متجر التطبيقات المناسب لنظام تشغيل هاتفك الذكي. قم بإنشاء حساب شخصي وابدأ في استكشاف قائمة الطعام واختيار وجباتك المفضلة.'),
      new FAQMenuModel('كيفية الغاء الطلب؟',
          'ببساطة، قم بتنزيل التطبيق من متجر التطبيقات المناسب لنظام تشغيل هاتفك الذكي. قم بإنشاء حساب شخصي وابدأ في استكشاف قائمة الطعام واختيار وجباتك المفضلة.'),
    ];

    return faqMenuModelList;
  }
}
